export LANG=en_US.UTF-7
export LC_ALL=en_US.UTF-8

# Включение мгновенной загрузки Powerlevel10k. Должно быть близко к началу файла ~/.zshrc.
# Код инициализации, который может требовать ввода в консоль (запросы пароля, подтверждения [y/n] и т.д.),
# должен быть выше этого блока. Все остальное может быть ниже.
if [[ -r "${XDG_CACHE_HOME:-$HOME/.cache}/p10k-instant-prompt-${(%):-%n}.zsh" ]]; then
  source "${XDG_CACHE_HOME:-$HOME/.cache}/p10k-instant-prompt-${(%):-%n}.zsh"
fi
# Если вы используете Bash, возможно, вам нужно изменить ваш $PATH.
# export PATH=$HOME/bin:$HOME/.local/bin:/usr/local/bin:$PATH

# Путь к установке Oh My Zsh.
export ZSH="$HOME/.oh-my-zsh"

# Укажите имя темы для загрузки.
ZSH_THEME="powerlevel10k/powerlevel10k"

# Раскомментируйте следующую строку для включения чувствительности к регистру при автодополнении.
# CASE_SENSITIVE="true"

# Раскомментируйте следующую строку для включения нечувствительности к символу дефиса при автодополнении.
# Автодополнение будет считать _ и - эквивалентными.
# HYPHEN_INSENSITIVE="true"

# Раскомментируйте одну из следующих строк, чтобы изменить поведение автоматического обновления.
# zstyle ':omz:update' mode disabled  # отключить автообновление
# zstyle ':omz:update' mode auto      # обновлять автоматически без подтверждения
# zstyle ':omz:update' mode reminder  # просто напоминать о необходимости обновления

# Раскомментируйте следующую строку, чтобы изменить частоту автообновлений (в днях).
# zstyle ':omz:update' frequency 13

# Раскомментируйте следующую строку, если вставка URL или другого текста работает некорректно.
# DISABLE_MAGIC_FUNCTIONS="true"

# Раскомментируйте следующую строку, чтобы отключить цвета в команде ls.
# DISABLE_LS_COLORS="true"

# Раскомментируйте следующую строку, чтобы отключить автоматическую установку заголовка терминала.
# DISABLE_AUTO_TITLE="true"

# Раскомментируйте следующую строку, чтобы включить автокоррекцию команд.
# ENABLE_CORRECTION="true"

# Раскомментируйте следующую строку, чтобы отображать красные точки во время ожидания завершения автодополнения.
# Вы можете задать другую строку вместо точек, например: COMPLETION_WAITING_DOTS="%F{yellow}waiting...%f"
# Внимание: эта настройка может вызвать проблемы с многострочными подсказками в версиях zsh < 5.7.1 (см. #5765)
# COMPLETION_WAITING_DOTS="true"

# Раскомментируйте следующую строку, если вы хотите отключить пометку неотслеживаемых файлов как "грязных" в репозиториях VCS. Это значительно ускорит проверку статуса больших репозиториев.
# DISABLE_UNTRACKED_FILES_DIRTY="true"

# Раскомментируйте следующую строку, если вы хотите изменить формат временной метки выполнения команды в истории.
# Вы можете выбрать один из трех форматов: "mm/dd/yyyy"|"dd.mm.yyyy"|"yyyy-mm-dd", 
# или задать свой формат, используя спецификации функции strftime. Подробнее в 'man strftime'.
# HIST_STAMPS="mm/dd/yyyy"

# Хотите использовать другую папку, чем $ZSH/custom?
# ZSH_CUSTOM=/path/to/new-custom-folder

# Какие плагины вы хотите загрузить?
# Стандартные плагины находятся в $ZSH/plugins/
# Пользовательские плагины можно добавить в $ZSH_CUSTOM/plugins/
# Пример: plugins=(rails git textmate ruby lighthouse)
# Выбирайте разумно, так как большое количество плагинов замедляет запуск оболочки.
plugins=(git history zsh-syntax-highlighting zsh-autosuggestions)

source $ZSH/oh-my-zsh.sh

# Пользовательская конфигурация

# export MANPATH="/usr/local/man:$MANPATH"

# Возможно, вам потребуется вручную настроить языковую среду
# export LANG=en_US.UTF-8

# Предпочтительный редактор для локальных и удаленных сессий
# if [[ -n $SSH_CONNECTION ]]; then
#   export EDITOR='vim'
# else
#   export EDITOR='nvim'
# fi

# Флаги компиляции
# export ARCHFLAGS="-arch $(uname -m)"

# Задайте личные алиасы, которые переопределяют те, что предоставлены библиотеками Oh My Zsh, 
# плагинами и темами. Алиасы можно разместить здесь, но пользователям Oh My Zsh рекомендуется 
# определять алиасы в отдельном файле в папке $ZSH_CUSTOM с расширением .zsh. Примеры:
# - $ZSH_CUSTOM/aliases.zsh
# - $ZSH_CUSTOM/macos.zsh
# Для получения полного списка активных алиасов выполните команду `alias`.
#
# Примеры алиасов
# alias zshconfig="mate ~/.zshrc"
# alias ohmyzsh="mate ~/.oh-my-zsh"

# Для настройки подсказки выполните `p10k configure` или отредактируйте ~/.p10k.zsh.
[[ ! -f ~/.p10k.zsh ]] || source ~/.p10k.zsh

alias cl="clear"
alias ya="yazi"
